

#Область ОбработчикиСобытийФормы
// Процедура - При открытии
//
Процедура ПриОткрытии()
	
	УстановкаЗначенийЗапуска(ЭтаФорма);
	ВидимостьДоступность();
	
КонецПроцедуры // ПриОткрытии()

// Процедура - При закрытии
//
Процедура ПриЗакрытии()
	
	ФормаПриЗакрытии(ЭтаФорма);
	
КонецПроцедуры // ПриЗакрытии()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - Командная панель формы: Восстановить настройку
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КоманднаяПанельФормыВосстановитьНастройку(Кнопка)
	
	ВосстановитьНастройки(ЭтаФорма);
	
КонецПроцедуры // КоманднаяПанельФормыВосстановитьНастройку()

// Процедура - Командная панель формы: Cохранить настройку
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КоманднаяПанельФормыСохранитьНастройку(Кнопка)
	
	СохранитьНастройки(ЭтаФорма);
	
КонецПроцедуры // КоманднаяПанельФормыСохранитьНастройку(Кнопка)

// Процедура - Установить флажки
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура УстановитьФлажки(Кнопка)
	
	Постфикс = ПолучитьПостфикс("УстановитьФлажки_", Кнопка.Имя);
	
	УстановитьЗначенияФлагов(ЭтотОбъект[Постфикс], Истина);
	
КонецПроцедуры

// Процедура - Снять флажки
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура СнятьФлажки(Кнопка)
	
	Постфикс = ПолучитьПостфикс("СнятьФлажки_", Кнопка.Имя);
	
	УстановитьЗначенияФлагов(ЭтотОбъект[Постфикс], Ложь);
	
КонецПроцедуры

// Процедура - Кнопка настройка периода нажатие
//
// Параметры:
//  Элемент	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КнопкаНастройкаПериодаНажатие(Элемент)
	
	ОснованаяЧастьИмени = "КнопкаНастройкаПериода_";
	
	Постфикс = Сред(Элемент.Имя, СтрДлина(ОснованаяЧастьИмени) + 1);
	
	Выполнить("ФормаНастройкаПериода(мНастройкаПериода_" + Постфикс + ", ДатаНач_" + Постфикс + ", ДатаКон_" + Постфикс + ");")
	
КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

// Процедура - Настройки регламентные: Перед окончанием редактирования
//
// Параметры:
//  Элемент				 - ЭлементФормы	 - Элемент формы для которого вызывается алгоритм
//  НоваяСтрока			 - Булево	 - Признак новой строки
//  ОтменаРедактирования - Булево	 - Признак отмены редактирования
//  Отказ				 - Булево	 - Признак отказа
//
Процедура НастройкиРегл_ПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Отказ ИЛИ ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки_Регл();
	
КонецПроцедуры

// Процедура - Командная панель: Получить
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КоманднаяПанель_Получить(Кнопка)
	
	Постфикс = ПолучитьПостфикс("ДействиеПолучить", Кнопка.Имя);	
	ПолучитьДанныеДляОбработки("Интерактивный", Постфикс);
	
КонецПроцедуры

// Процедура - Командная панель: Обработать
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КоманднаяПанель_Обработать(Кнопка, РежимЗапуска, РезультатВыполненияПостроителя)
	
	РежимЗапуска 		= "Интерактивный";
	Постфикс 			= ПолучитьПостфикс("ДействиеОбработать", Кнопка.Имя);	
	
	Обработать(Постфикс, РежимЗапуска, РезультатВыполненияПостроителя);
	
КонецПроцедуры

// Процедура - Командная панель: Оповестить через ДО
//
// Параметры:
//  Кнопка	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КоманднаяПанель_ОповеститьЧерезДО(Кнопка)
	
	Постфикс = ПолучитьПостфикс("ОповеститьЧерезДО", Кнопка.Имя);	
	ОповеститьЧерезДО(Постфикс);
	
КонецПроцедуры

// Процедура - Кнопка: регламентный запуск
//
// Параметры:
//  Элемент	 - ЭлементФормы	 - Кнопка, вызывающая процедуру
//
Процедура КнопкаРегламентныйЗапуск(Элемент)
	
	//КонтроллерАсинхронныхЗаданий.Регламентное_ОбменСправочникамиУППКогнос_ВыгрузкавКОГНОС();
	ПреобразованнаяТаблицаДляЗаписиВКогнос = Неопределено;	
	ПараметрыЗадания = Новый Структура;
	РегламентныйЗапуск(ПараметрыЗадания, ПреобразованнаяТаблицаДляЗаписиВКогнос);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Установить значения флагов
//
// Параметры:
//  пТЧ			 - ТабличнаяЧасть	 - Обрабатываемая табличная часть
//  пЗначение	 - Булево	 - Значение устанавливаемого флага
//
Процедура УстановитьЗначенияФлагов(пТЧ, пЗначение)
	
	Для Каждого Строка Из пТЧ Цикл	
		Строка.Обрабатывать = пЗначение;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Видимость/доступность
//
Процедура ВидимостьДоступность()
	
	ДоступнаРольПолныеПрава = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПраваРазработчики");
	
	ЭлементыФормы.Панель.Страницы.Регламент						.Доступность = ДоступнаРольПолныеПрава;
	ЭлементыФормы.Панель.Страницы.РегламентныйЗапускНастройки	.Доступность = ДоступнаРольПолныеПрава;
	
КонецПроцедуры

// Функция - Получить постфикс
//
// Параметры:
//  ОснованаяЧастьИмени	 - Строка	 - Основная часть имени элемента
//  ИмяЭлемента			 - Строка	 - Полное имя элемента
// 
// Возвращаемое значение:
// Строка  - Постфикс
Функция ПолучитьПостфикс(ОснованаяЧастьИмени, ИмяЭлемента)
	
	Возврат Сред(ИмяЭлемента, СтрДлина(ОснованаяЧастьИмени) + 1);
	
КонецФункции

// Функция - Получить постфикс
//
// Параметры:
//  ОснованаяЧастьИмени	 - Строка	 - Основная часть имени элемента
//  ИмяЭлемента			 - Строка	 - Полное имя элемента
// 
// Возвращаемое значение:
// Строка  - Постфикс
Процедура ЗаполнитьДаннымиСправочниковНажатие()
	
	ФормаОжидания = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, Новый УникальныйИдентификатор);
	
	Постфикс = Неопределено;
	ПреобразованнаяТаблицаДляЗаписиВКогнос = Неопределено; 
	ЗаполнитьТЧДаннымиСправочников("Интерактивный", ПостФикс, ПреобразованнаяТаблицаДляЗаписиВКогнос);
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаОжидания);
	
КонецПроцедуры

// Процедура - открыть настройки регламентного задания
//
// Открывает форму регламентных настроек
Процедура ОткрытьНастройкиРегламентногоЗадания(Элемент)
	
	Форма = ПолучитьФорму("НастройкиОбработки");
	
	Форма.ОткрытьМодально();
	
КонецПроцедуры

// Процедура - открыть форму статей затрат регламентных настроек
//
// Открывает форму регламентных настроек
Процедура СтатьиЗатратДляВыгрузкиНоменклатуры(Кнопка)
	
	Форма = ПолучитьФорму("СЗДляВыгрузкиНоменклатуры");
	Форма.ОткрытьМодально();
	
КонецПроцедуры

#КонецОбласти
